#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.babychelladj.data.digitalocean_domain.this: Reading...
module.code.data.digitalocean_domain.this: Reading...
module.music.data.digitalocean_domain.this: Reading...
digitalocean_domain.rileysnyder_org: Refreshing state... [id=rileysnyder.org]
digitalocean_droplet.do0: Refreshing state... [id=295334591]
data.digitalocean_kubernetes_versions.latest: Reading...
digitalocean_droplet.do1: Refreshing state... [id=295334594]
digitalocean_droplet.do5: Refreshing state... [id=295334592]
digitalocean_droplet.do3: Refreshing state... [id=295334593]
digitalocean_droplet.do2: Refreshing state... [id=295334595]
module.code.data.digitalocean_domain.this: Read complete after 0s [id=rileysnyder.org]
digitalocean_droplet.do4: Refreshing state... [id=295334596]
module.music.data.digitalocean_domain.this: Read complete after 0s [id=rileysnyder.org]
module.code.digitalocean_record.this-cname: Refreshing state... [id=290143978]
module.music.digitalocean_record.this-cname: Refreshing state... [id=290143342]
digitalocean_record.jksdfhopwety: Refreshing state... [id=313648850]
digitalocean_record.files: Refreshing state... [id=284235810]
module.babychelladj.data.digitalocean_domain.this: Read complete after 0s [id=rileysnyder.org]
digitalocean_record.do1: Refreshing state... [id=306011749]
digitalocean_record.s3: Refreshing state... [id=304234736]
digitalocean_record.metrics: Refreshing state... [id=284235809]
digitalocean_record.parson_tesla: Refreshing state... [id=313648851]
digitalocean_record.github_pages: Refreshing state... [id=285402102]
digitalocean_record.instance["kate"]: Refreshing state... [id=303069752]
digitalocean_record.instance["oca0"]: Refreshing state... [id=291765558]
data.digitalocean_kubernetes_versions.latest: Read complete after 0s [id=terraform-20220802231518251100000001]
digitalocean_record.requests: Refreshing state... [id=302658815]
digitalocean_record.do0: Refreshing state... [id=306011700]
digitalocean_record.security: Refreshing state... [id=303280195]
digitalocean_record.pushmetrics: Refreshing state... [id=294894686]
digitalocean_record.minecraft: Refreshing state... [id=284235811]
module.babychelladj.digitalocean_record.this-cname: Refreshing state... [id=326033787]
module.music.digitalocean_record.this-txt: Refreshing state... [id=290143343]
digitalocean_record.do4: Refreshing state... [id=306011702]
module.code.digitalocean_record.this-txt: Refreshing state... [id=290143984]
digitalocean_record.do5: Refreshing state... [id=306011703]
digitalocean_record.do2: Refreshing state... [id=306011710]
digitalocean_record.do3: Refreshing state... [id=306011701]
module.babychelladj.digitalocean_record.this-txt: Refreshing state... [id=326033789]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.ssenrah will be created
  + resource "digitalocean_kubernetes_cluster" "ssenrah" {
      + auto_upgrade   = true
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + ha             = false
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "ssenrah"
      + region         = "nyc1"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = true
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.23.9-do.0"
      + vpc_uuid       = (known after apply)

      + maintenance_policy {
          + day        = "sunday"
          + duration   = (known after apply)
          + start_time = "04:00"
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = false
          + id                = (known after apply)
          + name              = "core"
          + node_count        = 3
          + nodes             = (known after apply)
          + size              = "s-1vcpu-1gb"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rssnyder, Action: `pull_request`*